{"job_summary": "We're hiring a Bubble.io developer on a fixed-term contract to support post-launch technical maintenance, troubleshooting, and feature refinement for our platform. Work will begin once the application is live (expected in the coming weeks), and all engagements will be milestone-based with clearly defined scopes. We are looking for a reliable, experienced Bubble developer who can work on discrete technical tasks and bugs as needed, with potential for ongoing project-based work. SCOPE OF INITIAL CONTRACT To be determined. The initial contract will be defined based on: 1) Technical issues, bugs, or performance concerns identified during internal testing and/or early user onboarding 2) Small feature refinements or workflow corrections based on real-world usage *Please Note: Success of this first project in a timely and professional manner may lead to future opportunities with our team. REQUIRED SKILLS a) Advanced experience with Bubble.io (visual builder, workflows, data structure) b) Strong command of repeating groups, custom states, conditional logic, and responsive design c) Familiarity with Bubble's API integration (ie., Stripe, Square, Google Maps, etc.) d) Strong attention to detail with debugging and performance tuning e) Exceptional communication skills and documentation skills f) Exceptional math skills g) Experience working with MVPs DELIVERABLES - Fully functional, tested implementations of scoped fixes and improvements - Clean, maintainable workflows and reusable elements - Written documentation or screen-recorded walkthrough of work delivered - Delivery of bug fixes or enhancements as outlined in each fixed-term contract TIMELINE - Start Date: Upon launch of the platform (tentatively within the next few weeks) - Contract Type: Fixed-term, milestone-based - Availability: Flexible, based on mutually agreed deliverables and timelines *Please Note: The PRICE noted on this Upwork post is meant to be a placeholder only and will change once the scope has been determined. TO APPLY Please submit: - A short summary of your Bubble.io experience - 1–2 links to previous Bubble apps or components you've developed - Your availability starting in the next few weeks", "proposal": "Hello! I'm a madrid based Bubble dev. I'm interested in joining your project mainly because you seek someone who can jump into an ongoing project and solve problems quick and document to reserve engineer. I've worked with dozen mvps and a couple of real-world apps in two-week sprints formats with no room for error (one hotfix now and then). I have solid understanding of my responsibilities and I'm always there to provide critical thinking when needed. I've developed some product management skills working on my own and find myself very versatile when fixing errors. I'll leave more about me here: https://myself.reymondar-projects.online/ If my profile is of interest, let's talk. Ramon", "winning": "no"}
,{"job_summary": "I'm looking to work with a smart, efficient developer or no-code expert to build a travel experience discovery MVP. This is a lean build designed to test interest with real users and creators — not a polished final product. I'm open to either Next.js/Supabase or Bubble/WeWeb/Xano, as long as the tool fits the goals and keeps things moving fast and affordably. What We're Building: An MVP platform where creators can: -Share inspiring travel content (cards with images, descriptions, tags) -Link out to bookable affiliate tours (Travel experience provider) -Have a lightweight creator profile -Visitors can browse, filter, and click through to book Must-Have Features: -A mobile-first feed of travel \"cards\" (image + location + tags + link) -Tag/category filtering (e.g. \"beach\", \"adventure\", \"hidden gems\") -Creator login & simple dashboard (view content + basic performance) -Affiliate API integration (Travel experience provider) -Basic analytics (clicks/bookings per card or per creator) -Responsive layout, lazy loading or infinite scroll -Save/favorite feature for logged-in users -Instagram-style explore layout -Trending/popular content logic (based on views or clicks) Nice-to-Have Add-ons (Optional for MVP): Save/favorite feature for logged-in users Email capture or waitlist Social content embed (TikTok or IG) Stack Preferences (But Flexible): If you're coding: Next.js (App Router) + TailwindCSS Supabase (Auth, Postgres, storage) PostHog or similar for analytics Cloudinary for image performance If you're using no-code: Bubble (API connector + responsive UI) or WeWeb + Xano combo (also fine) Timeline & Budget: Timeline: 3–4 weeks max Budget: ~$1k-2k AUD for MVP (open to reasonable proposals) This MVP is part of a larger vision — so clean, scalable work may turn into long-term collaboration Who I'm Looking For: Proven experience building content feeds, marketplaces, or affiliate tools Clear communicator — async is fine, just keep things transparent Can share examples (live links or Looms preferred) Open to jumping on a quick intro call Interested? Please send: A short intro A couple of relevant projects (code or no-code) Your recommendation on stack/tool based on the above Ballpark estimate of hours or cost to complete MVP", "proposal": "Hello, I'd like to propose building your mvp with Bubble.io (no Xano - probably that's AIs recommendation , but whatever) because it's light, fast to execute and you can kick off building with the guarantee of lower long-term costs and simplify scaling or pivoting based on user feedback. That is why Bubble is my go-to also. I've built dozen of mvps and have been creating sites and crms for over 4 years, here me : https://myself.reymondar-projects.online/ I work at a fast pace and have built solid product management skills that make me a critical thinker when it comes to building. I bring guidance, marketing insights, and user experience criteria to help make smart decisions. Not just on design, but also on strategy, priorities, and how a product fits into the bigger picture. I'll have you covered up and will build your product in your stipulated time-frame. I can do this project for around $1.500usd in your 3-4 time frame. Have a nice day, Ramon.", "winning": "no"}
,{"job_summary": "We're an early-stage startup in the AI podcast management space with a working MVP and 10 active customers. We're looking for a Bubble developer who can commit to 20 hours per week over the next 2–4 weeks, with potential for ongoing work. This role is high-collaboration, working directly with the founder and technical team to fix bugs, fine-tune workflows, and support a growing feature set. You'll need to be available for daily standups and to report progress in ClickUp. What You'll Be Doing: - Tackle and resolve frontend bugs in Bubble - Collaborate closely with the founder on task prioritization and delivery - Join daily check-ins and provide updates on task status in ClickUp - Communicate effectively via Slack for quick feedback and unblockers - Interface with our backend team as needed (AWS-hosted APIs) About Our API Workflows: We maintain a comprehensive Postman collection and internal documentation to support our API workflows. Most backend operations are handled through a CI/CD pipeline into AWS. While the system is stable and functional, we're open to improvements as we continue growing — and we value developers who can spot opportunities to optimize. Who You Are: - Experienced with Bubble.io and comfortable working on fast-paced MVPs - Familiar with API integrations, conditionals, and performance debugging - Organized, proactive, and accountable for delivery - Available to work closely with a founder and handle detailed feedback loops - Comfortable in ClickUp and Slack-based environments Nice to Have: - Interest in podcasting, media tech, or AI tools - Previous experience in short sprint cycles or bug-hunting phases What You'll Get: - A focused scope: work directly on bugs and high-impact UI tasks - A structured workflow: clear priorities, daily alignment, and collaborative planning - The potential for longer-term work as we grow To Apply: Please include: 1. A few relevant Bubble projects (especially ones with external API workflows) 2. Your availability over the next 4–6 weeks (days/times) 3. A sentence or two about how you've worked in sprint-style dev teams before", "proposal": "Hi, I'm a Madrid Based bubble dev with real two-week sprint projects. I've acted as front-end dev for orderMe, an argentinian Startup with 8 team members. As a bubble dev I specialize in MVPs, although I tend to work alone for the most part of it. I'm currently mantaining 3 apps, and have -20hours availability to jump into your project if my profile seems of interest to you, that's why I didn't want to miss out the opportunity of sending my proposal. I work fast, and document everything I do. I'm used to collaborating and jumping into existing projects specially for optimization. I'll leave you more about me here https://myself.reymondar-projects.online/ If you think we could be a good fit, let's chat - Ramon.", "winning": "no"}
,{"job_summary": "Fractional Product Manager (ca 5 h / week) Remote — Contract / Hourly Mission Own the end-to-end product process for Insolv.io's Bubble-built MVP, ensuring every sprint ships usable, compliant, and performance-grade features on time and on budget. Key Outcomes (you'll be measured on) Clear specs — Translate founder vision into user stories with acceptance criteria before each sprint. Design sign-off — Validate Figma wire- & hi-fi screens for usability, responsiveness, and brand consistency. Sprint governance — Run the weekly demo/QA call; maintain a kanban board; close more than 90 % tickets per sprint. Quality gate — Approve release only when features meet performance ( less than 1.5 s load EU), GDPR, and analytics standards. Continuous feedback — Deliver a concise status + risk report every Friday. Typical Weekly Rhythm (≈5 h) 1 h backlog grooming with founder 1 h design review + Loom feedback 1.5 h sprint demo & QA with Indian Bubble devs 0.5 h async ticket triage / documentation 1 h contingency for ad-hoc advice What You Bring 4 + years shipping SaaS or marketplace products (no-code/Bubble a plus) Solid grasp of UX heuristics and basic analytics (Mixpanel/Hotjar) Experience working with offshore engineering or design teams Strong written communication and ruthless prioritisation skills Bonus: knowledge of EU GDPR & Stripe payments flows Engagement Details Hourly contract, invoiced monthly Initial term: 16 weeks (MVP build) with extension option Time-zone overlap: min. 2 h with Europe/Zurich & India per week Tools: Figma, Notion, ClickUp/Jira, Loom, Google Workspace, TBD Overall, your approach to making this work would be interesting to hear. Sound like a fit? Send a brief portfolio or two shipped product links.", "proposal": "As a former CRM manager for my company (3yrs), I used and customized more than 50 different accounts for GoHighLevel, the SaaS popularly sold as a white-labeled product. For the past 2 years, I've been developing in Bubble and built all sorts of products, including SaaS. The fact that your job requires someone with real hands-on experience in your timezone (I'm based in Madrid) is what made me send this proposal because I feel I'm a great fit. I'm professional and have near-native English proficiency. If you are interested in my profile, let's talk. I'll leave you my portfolio: https://myself.reymondar-projects.online/ Have a nice day, Ramon", "winning": "yes"}
,{"job_summary": "Bubble Developer Needed for Simple AI-Powered Business Assistant MVP (Web + Mobile Responsive) Job Description: I'm looking for a skilled Bubble.io developer to build a working MVP for a simple, powerful business assistant app. This will help entrepreneurs stay on top of tasks, finances, team actions, and marketing—all in one clean, user-friendly dashboard. The app must: • Pull in real financial data from tools like Stripe, QuickBooks, Xero, and Sage • Use AI (OpenAI/GPT) to generate marketing content like emails, social posts, and ads • Show a clear \"what to do next\" dashboard with minimal clutter • Allow team task assignment, simple job post creation, and light HR tracking • Be fully responsive (desktop and mobile) • Automate back-end logic using Zapier or Make where needed This is a proof-of-concept, but it needs to be a live, working product—not just a prototype. We already have a clear product vision, user journey, and sample wireframes. Your job is to bring it to life quickly and cleanly. Key Features to Build: 1. Smart Focus Dashboard • Shows top 3 priority tasks • \"What should I do next?\" AI button • Visual display of income, profit, top-selling services 2. Finance Module • Pulls live data from: • Stripe • QuickBooks • Xero • Sage • Shows clear visuals: profit line chart, revenue/expenses, cash flow • Flags any anomalies (e.g. unpaid invoices or drops in revenue) 3. AI Marketing Content Tool • Connects to OpenAI (ChatGPT API) • User enters brief or goal; AI suggests post/ad/email • User can select tone and generate/post content • Optional: integrate with Buffer or social APIs via Zapier 4. HR & Team Support • AI-generated job post creator • Simple task board for small team assignments • Optional \"mood check\" or light feedback loop 5. Calendar Integration • Google Calendar sync • Shows upcoming events on dashboard • Allows \"focus mode\" with reminders off/on Technical Requirements: • Must use Bubble.io for entire MVP • Must be confident using Bubble API Connector with OAuth and REST • Integrations: • Stripe • QuickBooks • Xero • Sage • Google Calendar • OpenAI (GPT-4 or GPT-3.5) • Zapier or Make.com (for scheduling, reminders, etc.) • Design must be clean, calming, and built for users who don't like clutter • Light/dark theme or high-contrast layout a plus Deliverables: • Fully working MVP with connected APIs • Simple UX (task, finance, marketing, HR modules) • Mobile + desktop views tested • Source access and documentation What We'll Provide: • Sample wireframe and dashboard layout • Clear guidance on user needs and use cases • Support with copy and structure if needed To Apply, Please Include: • Examples of any Bubble apps you've built (especially dashboard or AI-related) • How you'd approach this project • Whether you've worked with API integrations (Stripe, GPT, QuickBooks, etc.) • Any experience designing for users who need simplicity, clarity, and reduced overwhelm Please keep this project confidential. This is a first-to-market product with no public competitors. Project Type: One-time project Experience Level: Intermediate to Expert Hours Needed: To be proposed by you (Fixed Price preferred) Expected Duration: 3–6 weeks (MVP phase only) Skills Required: • Bubble.io • No-Code Development • API Integration • OpenAI / ChatGPT • Stripe API • QuickBooks / Xero / Sage • UI/UX Design • Zapier or Make.com • Google Calendar Integration • Dashboard Design • Responsive Web App Development Screening Questions (Recommended): 1. Have you built a Bubble app with connected APIs like Stripe, QuickBooks, or OpenAI? 2. Can you show me a sample dashboard UI you've built in Bubble? 3. How would you approach designing an app for non-technical users who need a very calm and clear interface? 4. Have you built with Zapier or Make.com automations", "proposal": "This all-in-one product seems very innovative. I would approach this build setting 6 sprints - one for each week - where at the end of each week it would be possible to test out new features. I must say it looks like a big product and a very refined version of this, should include an all-around feature such as a main dashboard were every feature of the app is displayed in a summary-like mode, very much like GoHighLevel. The design for such an app should include intuitive navigation where users should have to make minimum movements to see displayed data. For example, the finance section, maybe one of the most challenging, should have a feature to hide, and filter what data to see first since on mobile view graphs get very bulky. I worked with GoHighlevel, Pabbly, BotPpress and Zapier creating integrations for over 3 years, I'm proficient with SaaS products and built many dashboards myself and AI prods. You can check out my portf projects https://reymondar-projects.online/leadx-dashboard - Basic SaaS prod from a figma design file https://reymondar-projects.online/ - AI social media platform with photo + text generation This project is an interesting thing I see myself more than capable of building, in case you want to check my background I'll leave you my site so you can know more abt me and see if my expertise is fit for you. https://myself.reymondar-projects.online/ If we do 40hrs/week it could be done in 4-5 weeks - which be around $4000 - $4900 fixed Thanks for reading my proposal, be safe. Ramon", "winning": "yes"}
,{"job_summary": "We are seeking a skilled freelancer to complete a bubble template for our blog site. The template has been acquired but requires the integration of a proper data schema. This role requires attention to detail and a solid understanding of bubble.io functionality. This is not a static website, instead potential users will be able to build their own blogs. Initial PRD will be given with the user stories and details. If you are passionate about building engaging web experiences and have experience with bubble templates, we want to hear from you!", "proposal": "Hello, I used to work for EmptyCode which specialized in Templates creation from ground zero. I've got quite a good understanding on the field although I wouldn't call myself an expert since I've seen people doing the impossible. I would really like to now more about this project, I think it's interesting to provide such a tool and be the one to build it. I've been developing in Bubble for two years now and I see fit for your offer, so if you would like to hear more about me I'd be glad to have an convo with you! Have a great day, and thank you for reading me! Ramon. * Describe your recent experience with similar projects Last year I worked for half a year or so for an agency that specialized in templates and plugins creations. It was wild because I got to be on the product side of Bubble, and I think it's valuable for this sort of projects * Include a link to your GitHub profile and/or website My website (not paying the plan anymore) : https://stockerx.bubbleapps.io/version-test * Github (back from the days): https://github.com/reymondar * My last project on upwork: confettilist.com", "winning": "no"}
,{"job_summary": "We are seeking an experienced Bubble.io developer to join our team for the development of an application. The ideal candidate will have a strong understanding of Bubble.io and its capabilities, as well as experience in designing user-friendly interfaces and implementing workflows. You will collaborate closely with our product team to turn ideas into functional applications quickly and efficiently. If you have a passion for no-code solutions and can deliver high-quality work, we would love to hear from you! Requirements: - Extensive experience with Bubble.io and no-code development. - Ability to build dynamic workflows, data structures, and user interfaces. - Experience integrating APIs and third-party tools (e.g., Stripe, Zapier, Make.com). Optional Requirements: - Experience with ClickUp integrations. - Basic knowledge of JavaScript for custom Bubble plugins. - Background in SaaS or business automation", "proposal": "Hey, I saw this offer and couldn't resist introducing myself! Everything you're looking for in a new team member, from teamwork with agile methodologies to api connections and wireframing complex data relationships, definetly suit my profile. I've got a background as a React dev, I could definetly step in if any custom js is needed on the way of development. I've worked for 3 years managing the Gohighlevel clients of my agency creating pipelines, integrations and as a webmaster. I'm proficient in Bubble, APIs, and all types of workflows and complex implementations within the app. Truth is, I'm don't consider myself a designer, I have a better eye for development and quick thinking when it comes to problem-solving. I've just finished delivering a SPA (confettilist.com) with more than 15k database records, so I'm comfortable working with large applications. If you need someone who can keep track of working in teams for complex application, I'd be glad to hear the type of projects you work with. Hope to hear more from you, Ramon!", "winning": "no"}
,{"job_summary": "Complete set up of a social media app on Bubble.io. Looking for an entry level developer or experienced Bubble developer to complete the task. Looking for someone who will be passionate about the project and bring fresh new ideas and look and feel to our app! To get an idea of the project, feel free to make a test account at the web address below.... https://aloha.live/version-test/register I am paying minimum hourly rate to complete the task but will be paying kick backs to developer once the app has been launched and is making an income. This could be a great opportunity for an additional stream of income for many years to come for the right developer! We will be doing ten hours per week on development to start with, if I am happy with the progress and quality of work after a few weeks, I will increase the hours per week Tasks to complete: Complete existing bubble.io app and ensure app is running smoothly and working correctly and looking fresh and modern. The app needs to be super responsive so screens load up instantly. Finalize dating and friends and followers sections. These need to be finished and working smoothly. Add interactive gaming and virtual meeting programs for members to use to interact with other singles Set up payment methods and membership for users. Add chat rooms and chat features to app", "proposal": "Hey! your social media app sounds promising. Here is my offer: Get the app ready for deployment as fast as possible. For fast load times, setting up a well-structured database prior to development is essential, as well as measuring the resources to be used. If it's going to be a large-scale application, the WU (workload units) will have a significant impact on your billing. Your chat function can be created in minutes using Bubble's native DB. Everything around users would be childsplay since Bubble is easy to set up. Other than that, what API would you be using for payments? Stripe maybe? I'm a certified Bubble developer with about 3 months of experience. I'm looking for my first project on Upwork, where I aim to earn an extremely positive review by delivering impeccable work. If you're interested, I'm here and ready to chat!", "winning": "no"}
,{"job_summary": "We are seeking a talented bubble.io developer to create a user-friendly website that allows customers to order AI-based translation services, complemented by human review. The modules needed are Login, Request a Quote (where customer must upload the file to be translated and select source language and target language), e-mail module to notify administrator to quote the job, e-mail the customer the quote, in addition to a list of orders which can be sorted on requested, quoted, ordered etc.)., and finally a Stripe implementation so the customer can pay before we translate. The candicate need to have completed at least 5 projects in bubble.io. We will specify in detail the project, but we need initially a budget quote from the candidate plus delivery time! You would need to own a necessary license in bubble.io.", "proposal": "Heyy! Project looks promising. Sounds interesting. I would approach this thinking of the quote system as a small lead-management board (Trello like) to manage every file, quote and mail sent. On the other hand you'll need to have some sort of dashboard to manage clients and payments. I'm a new Bubble Certified Dev in Upwork. Been on it for months, and have a background as a front'end dev. I have ton of experience in automation services and integrations such as sendingrid to handle your emailing. Also strong APIs integrations as well with OpenAIs. A dashboard for professional could be built in as well to keep communication inhouse. Time necessary for this would be 3/4 weeks on a $15/hr. Total budget about $430 since my goal is to land my very first project here. Super negotiable. I'd like to hear more about this, I can get hands on this asap and make a work that shines. Have a good one ;)", "winning": "yes"}
,{"job_summary": "We are seeking an expert Bubble.io engineer to join our dynamic team. You will work on a SaaS product with a steady pipeline of projects, contributing to innovative solutions without the restrictions of micro-management. Ideal candidates should have a passion for collaborative work and a strong focus on delivering high-quality results. If you're ready to take your skills to the next level and thrive in a supportive environment, we want to hear from you!", "proposal": "Even with limited availability, I'd be willing to lay off a couple of projects I'm currently maintaining if your offer is interesting enough, and you see me as a good fit! I'd like to make something super-clear, I excel at what I do because I really love it, but I can't design a single hero page. For what's worth I've worked for 3 years as a CRM director managing GoHighlevel and Hubspot clients for lead management and talent recruiting for Mexico and Guatemala. Given that you are building a SaaS product, I find this useful. My passion is creating and I work best when motivated. This is why for over 4 years now I've studied and worked as a front-end and no-code dev (specialized in Bubble.io). I'll leave some more about me so you can see some yourself - https://myself.reymondar-projects.online/ If you think we could work together, I'm all in to whatever interview process you've got for me. Hope you have a nice day, Ramon!", "winning": "no"}
,{"job_summary": "We are seeking a talented Bubble developer with over 4 years of experience to join our team for a long-term project. The ideal candidate will have a strong background in building applications on the Bubble platform, excellent problem-solving skills, and the ability to work collaboratively in a fast-paced environment. You will be responsible for designing, developing, and maintaining a dynamic bubble application. If you are passionate about no-code development and thrive in a team setting, we would love to hear from you! We are looking for an independent developer, any agencies will not be considered", "proposal": "Hi There, I love having the chance to actually join a team since I like working with people more capable than I am and colleagues are an excelent way to learn. I'd like to share about myself. I've worked with Bubble for the past year and a half, developed dozen of MVPs and woked alongside top-notch developers who taught me most of what I know today about scalability and best practices. I have a background as a front'end dev and worked for a startup as a main dev. I'm a team player, I'm always available to meet and spend most of my day on my PC. Anyways, this is me you can find the whole thing here https://myself.reymondar-projects.online/ If interested, ring me. Ramon.", "winning": "no"}
,{"job_summary": "We're a B2B demand-generation and ABM agency, and we've built a Bubble.io-based content library that drives thousands of leads every day. Prospects land on individual asset pages or branded ContentHubs, sign up once, then freely explore white papers, eBooks, webinars and more without ever filling out another form. We're looking for a Bubble.io expert to join us as a true partner—about 20 hours per week on an ongoing basis. You'll work closely with our team to add AI chatbots that guide users through our catalog, build smart content recommendations based on user behavior, and extend Bubble with custom plugins or API workflows wherever needed. To succeed in this role you'll need proven experience launching production Bubble apps, hands-on knowledge of AI APIs (OpenAI, Dialogflow or similar), and the ability to write custom JavaScript/Node.js when Bubble's built-in tools fall short. You should be comfortable overlapping 3–4 hours a day with our Europe/London schedule for stand-ups and quick questions, and happy to share progress each day via Slack/Email. We want this to be an on-going relationship over the years ahead", "proposal": "Hi, I'm a Madrid-based developer. With strong OpenAI integration experience, I can comfortably jump into the nitty-gritty and get things up and running with proper documentation for reverse-engineering and easier maintenance. I have a background as a former React.js developer, which I use to complement my Bubble knowledge when solving problems. I've never been much of a plugin person, so I always prefer solving everything my own way. I'm a self-made Bubble professional developer. I've deployed many real-world apps and am currently working on multiple MVPs, which is why your 20-hour weekly opportunity is amazing for me. I look forward to the possibility of working together. If you'd like to know more about me: https://myself.reymondar-projects.online", "winning": "no"}
,{"job_summary": "I'm developing a simple web-based app designed to increase employee engagement with workplace wellness experiences. The concept is centered around a badge-based \"passport\" system that rewards employees for consistent participation. At this stage, I'm exploring whether to build the MVP using: -No-code/low-code platforms (e.g. Lovable, Softr, Glide, Replit, or Cursor) -A lightweight front-end plus Supabase or Firebase backend -Or another efficient architecture you can recommend I'm seeking a skilled developer, technical product builder, or no-code specialist who can help me think through the best approach—balancing simplicity, UX quality, and potential scale—and ideally collaborate on an initial prototype if we're a good fit. Vision for the app is to give users a personalized \"passport\" where they can: · Track progress across several categories of wellbeing · Unlock badges based on behavior or session participation · See reward progress toward prizes or recognition · Participate in light contests (e.g., milestone rewards, raffles, first-to-finish) · HR admins will have a view of participation data to understand how their teams are engaging with wellness programming. · The app will also ideally have an automation layer to it whereby we automatically distribute some of the types of prizes to employees once they win I've already built a visual prototype of this in Lovable and have the flow mapped. I'm now looking for someone who can offer insight into the most efficient and scalable way to bring it to life—without overengineering. I am working with a bit of a limited budget. What I'm Looking For: -Someone who can advise on architectural choices (no-code vs custom vs hybrid) -Familiarity with tools like Lovable, Supabase, Replit, Cursor, Softr, Glide, Pabbly, Airtable, Firebase, or similar -Ideally able to collaborate on prototyping or early-stage development if the direction is a fit -Strong communicator with product sensibility—I'm not looking for a pure executor, but someone who can co-think with me Note: Detailed workflows, brand visuals, and proprietary logic will be shared only after selecting a qualified partner and signing an NDA. Timeline: I'd like to begin conversations this week, with a goal of selecting a direction and scoping the MVP by next week. To apply, please share: · What platforms or stacks you would consider for this type of app and why · Any relevant experience building gamified dashboards, wellness tools, or low-lift engagement apps · Whether you also offer prototyping or MVP build services Thank you and looking forward to exploring this with the right partner.", "proposal": "Hi, I've developed quite a few MVPs in the past 2 years with Bubble and am currently seeking opportunities like such were I can develop a more strategic role, such as yours. I'd like to discuss ideas and bring your application to life. I'm extremely proficient with Bubble, which is why I'd recommend buiding your app with such stack. It's a fullstack no-code platform ideal to prototype products fast. That is why this is my app of choice to develop and will continue to be until I become a \"real\" product manager. So, from what I've read about it you can problably built it in a 4-5 week range at 20/hr a week. I'd say your ideal scenario would be to already have the gamification system polished enough to implement it as fast as possible. You can see more about me here: https://myself.reymondar-projects.online/ Have a nice day, Ramon.", "winning": "no"}
,{"job_summary": "I need an MVP for a D2C website. Can be developed using Bubble or other no-code platform. Goal is working prototype for demo, pilot, and fundraising -- delivered quickly. Wireframe is set. Will need to integrate with API from tech provider and produce a tamper-proof certification with score (provided by API). This certification must have a unique code so as to be verifiable by anyone. So, there are two parts -- the API and credential as well as the verification system. To proceed, please express interest with a rough estimate of time to develop and cost for entire project. Also provide some details about experience building fast MVP. If selected, an NDA will be required, then an introduction call and review of wireframe and detailed specifications. We will move to NDA and intro call with five candidates, selecting one. Equity or cash, or mix thereof, is possible, if desired", "proposal": "Hi, i'm interested in hearing about your proiject. I'm a madrid based Bubble dev with Product Management experience in case you need a brain to sort out problems and share ideas with to build a successful mvp and avoid spending money worthlessly (if that's a word). So, I'll leave more about me here. https://myself.reymondar-projects.online/ I'ive worked with lots of MVPs as a dev and most of them have failed. I can help you out succeed. Let's chat if you are interested. Ramon", "winning": "no"}
,{"job_summary": "I'm launching JoynOS — a bold new platform that helps people meet IRL by matching them with spontaneous social plans based on vibe, availability, and personality (think: rooftop drinks, group hikes, game nights — no awkward profiles or endless swiping). I'm looking for a talented no-code developer (Bubble, Glide, or Adalo) OR a lightweight frontend dev (React Native or Flutter) to help build a clickable, testable MVP. The prototype should do: • User onboarding flow (name, city, pronouns, gender preference, open to 1:1 or group) • Personality & vibe quiz (pre-written, think \"Which type of hangout fits you?\") • Match logic to group users based on plan vibe compatibility • Simple plan suggestion UI: \"You're matched for a Thursday night hang – here's the plan!\" • Mock group chat preview (no backend needed yet — can be placeholder) Include a lightweight, in-app group chat feature that allows matched users to communicate before an event. Chat should be temporary, nickname-based, and expire after the plan to ensure safety and simplicity. Include basic analytics tracking to capture key user actions (e.g. onboarding completion, plan selection, matches, chat engagement). Integrate a lightweight tool like Google Analytics, Mixpanel, or PostHog for usage insights", "proposal": "Hi, your project sound a lot like one I used a while ago called Meetup. JoynOs seems really promising. I think this sort of product should also have a mobile development oriented from the very start. I think this should also include some sort of global chat or forum for people to leave real feedback and be able to discuss different activity matching and new feature ideas. Also profile customization should be a key-point here in order to make people find compatible users to do different type of activities and not leave a key point at random. These are just wild ideas, but I think in the way to make products grow from minute 0. As an MVP builder I don't limit myself to just create what I'm tasked with, I also provide critical thinking and a marketing perspective when needed. I like creating products that are truly scalable and will help me as well to showcase in the future. I care about my reputation as well, which is why I always aim to deliver high quality results always. I'd recommend building this with Bubble/Flutterflow for the mobile dev. I'm just a profiessional bubble dev with enough expertise to condifendtly bring your project to life. Let me know if you like what you read. Ramon. https://myself.reymondar-projects.online/", "winning": "no"}
,{"job_summary": "I'm looking for a Bubble.io developer to help build a clean, internal tool with three main components: - A drag-and-drop block-based editor - A public viewer page for the output - A user dashboard to manage and preview pages This will involve structured page building logic, reusable components, conditional rendering, and clean UI polish. 🛠️ Tech Stack & Plugin - Platform: Bubble.io - Plugin: DragIt – Repeating Group Drag & Drop You'll need to purchase this ($25). To keep things simple, I'll cover the cost as a milestone - just provide proof of purchase. 📦 Project Scope You'll be building the following pages: Editor Page - Left panel: draggable block picker - Center canvas: repeating group of blocks with drag-to-reorder - Right panel: block settings (basic style controls, toggles) - Device preview toggle (mobile/tablet/desktop) - Global theme mode (light/dark) - Auto-save on changes Viewer Page - Renders output blocks with matching styles - Includes copy link button, password protection modal, expiry toggle, view counter - OG meta tag support and back-to-top button Dashboard Page - Filterable card-style layout (Pages, Resources, Templates - dummy filters) - Page info (title, views, created date, privacy status) - Buttons: Edit / View / Duplicate / Delete / Copy Link - UI placeholders: Draft/Published toggle, folders or tags (non-functional for now) - Include a basic Analytics page or section (dummy view count summaries only) Settings Panel - Page title, description, favicon, OG image, expiry date, password (optional UI) 🎯 Project Details - Must be fully responsive, cleanly organized, and modular (so I can reuse components) - Use dummy data for now - Optional: Include brief Loom walkthrough at the end 📝 Important Notes - This is just a UI/logic build - no database or backend-heavy logic - Scope may shift slightly as we test functionality - I'll communicate clearly - Strong Bubble fundamentals, attention to detail, and clean group structure are essential - Exact details will be provided to shortlisted candidates If done well, there is an opportunity for more work in the near future. Don't hesitate to apply if you think you can do this task well! Look forward to reading your proposal", "proposal": "Hi, I'd like to say I don't think is really necessary you have to buy a plugin to add a drag and drop funcionality. I can take over your project easily, I've built many dashboards and with the right design, it could be possible to pull of quite fast. I've been working with Bubble for around 2 years now and find myself capable of bringing to life this idea of yours. https://myself.reymondar-projects.online/ I am partly a product manager since I've created many MVPs single-handed and have a 360 vision for product development, which is why I can provide expertise and critical thinking to your project. I can assist holisticly with whatever you might need other than the development. If interested, let's chat! Have a nice day. Ramon", "winning": "no"}
,{"job_summary": "Project Title: One Click CGT Web App MVP Purpose Deliver a one-click capital gains tax (CGT) calculation tool that takes a user's stock trading history and instantly generates an ATO‑compliant report (ATO = Australian Taxation Office). Overview We are building One Click CGT, an MVP web application that enables self-directed investors to upload trading data (CSV/XLSX), validate their inputs, and receive an accurate CGT calculation in seconds via ChatGPT. This streamlines what is currently a manual, error-prone process. Customer Journey 1. User lands on the homepage and sees the tagline. 2. User signs up or logs in (email or social login). 3. User clicks \"Calculate my CGT\" to begin. 4. User selects the financial year from a dropdown (e.g., 2023–24). 5. User uploads full trading history (CSV/XLSX) — recommend including the full list or at least 1–2 years before/after the chosen year, with an in-line banner and acknowledgment checkbox on data accuracy and liability. 6. If payment is pending, a Stripe/PayPal prompt appears; otherwise processing begins. 7. App sends parsed data to OpenAI GPT‑4o for CGT computation. 8. User views results on screen and can download a free PDF report. 9. App provides a shareable link and optional Excel export. 10. User logs out or schedules a reminder for the next tax year. Key Features - Landing Page: Prominent call‑to‑action emphasizing \"One‑Click\" simplicity. - Authentication: Secure email and social logins. - File Upload & Validation: Drag‑and‑drop support with instant data-range feedback (alerts if uploaded history falls short of the recommended 1–2 year buffer around the selected financial year). - Payment Integration: Flexible Stripe or PayPal checkout. - AI Calculations: Real-time CGT calculation powered by OpenAI GPT‑4o. - Report Generation: Downloadable PDF and Excel exports. - Landing Page: Prominent call‑to‑action emphasizing \"One‑Click\" simplicity. - Authentication: Secure email and social logins. - File Upload & Validation: Drag‑and‑drop support with instant data-range feedback. - Payment Integration: Flexible Stripe or PayPal checkout. - AI Calculations: Real-time CGT calculation powered by OpenAI GPT‑4o. - Report Generation: Downloadable PDF and Excel exports. Technical Stack - Frontend & Workflow: Bubble.io (API Connector, CSV Parser, PDF Conjurer) - Authentication: Firebase Auth or Bubble Auth plugin - Payments: Bubble Stripe/PayPal plugin - AI: OpenAI GPT‑4o API - Hosting & Database: Bubble hosting, with optional Firebase backup Deliverables - Fully functional Bubble.io MVP reflecting the customer journey above - Documentation on workflows, plugin settings, and API calls - Sample test accounts and datasets - Deployment and hand‑off session with your team Timeline & Budget - MVP Delivery: 4–6 weeks - Budget: TBD based on your proposal and scope Required Skills - Proven Bubble.io development experience - Experience integrating with OpenAI APIs - Familiarity with Stripe/PayPal plugins - PDF generation expertise in no‑code tools - Strong communication and documentation abilities How to Apply Please include in your proposal: - A brief cover letter describing relevant Bubble and GPT API projects - Links to portfolios or case studies of similar work - Your estimated timeline and budget for this MVP", "proposal": "Hello, I'm interested in bringing your project to life, I'm a Bubble dev with Product management vision and attitude. If I'm in charge of your project I wont limit myself to build it, but also help you design every piece of it in order for it to actually grow and have real potential. A couple of examples, just from what I've read: -You should take into consideration documents uploaded to your site will be sensitive, this should be done once the user is logged in and agreed to your TOS to avoid legal issues. -The authentication process and database should be handled entirely within Bubble. Adding unnecessary tools or stacks will complicate your workflows, make maintenance harder, thus driving up costs. -You should include some sort of user dashboard where he can manipulate all of his files and reports. -Besst way to generate automated reports are with AI agents (n8n), not directly with OpenAI. I could handle the design phase within 1–2 weeks, followed by building and integrating the workflows over the next 4–5 weeks. I'd start with the AI integration and design, as once we move forward with Bubble, that part comes very naturally to me. I've developed over 10 MVPs and feel fully confident in my ability to bring this great idea of yours to life. I would work at $23/hr (negotiable) at 30hr/week. If my approach interests you, find more about me here: https://myself.reymondar-projects.online/. - Let's chat. Ramon", "winning": "no"}
,{"job_summary": "We are looking to hire an experienced Bubble.io developer or agency to build a responsive web application called \"Momentum.\" This app is designed to be a simple, intuitive tool for freelancers to manage their projects, log their work activities, and create invoices. The goal is to create a streamlined, user-friendly platform that avoids unnecessary complexity and focuses on the core needs of a freelancer: organizing work, tracking time spent, and getting paid efficiently. The full project specification is available for shortlisted candidates. Core Features & Functionality: - We have a clear project specification that outlines the following key features: Client & Project Management: - Users must be able to create and manage a database of their clients. - Users must be able to create projects and associate them with specific clients. - Within each project, users should be able to create a simple list of tasks. Manual Activity/Time Logging: - Users will log their work manually. There is no need for an automatic start/stop timer. - Each entry should include a description of the activity and the time spent. - Logged activities must be linked to a specific task/project. - Users should be able to mark entries as \"billable.\" Flexible Invoicing: - The core of the app is its ability to generate professional, customizable PDF invoices from billable activities. - Crucially, users must be able to generate an invoice for either: (1) A single, specific project. (2) An entire client, which would consolidate all billable activities from multiple projects for that client onto one invoice. - Integration with Stripe - Simple invoice status tracking (e.g., Sent, Viewed, Paid, Overdue). Dashboard & Reporting: - A simple dashboard showing key metrics like total revenue, outstanding payments, and total hours logged. - Basic reporting to view logged activities and income, with the ability to export data to PDF/CSV. Required Skills & Experience: - Expert-level proficiency in Bubble.io is a must. - Proven experience building and launching complex, responsive web applications on Bubble. - Strong experience integrating Stripe within a Bubble application. - A keen eye for clean, modern, and intuitive UI/UX design. The application must be easy and enjoyable to use. - Excellent communication skills and a proactive approach to project management. - Ability to work from a detailed project specification and provide constructive feedback. To Apply, Please Provide: - A link to your portfolio or at least 2-3 examples of live Bubble applications you have built that are similar in scope or complexity. - A brief summary of your experience with Bubble and API integrations. - Your estimated timeline for completing this project. - Your hourly rate or a fixed-price bid for the project.", "proposal": "Hello, I'm a madrid based Dev specialized in Bubble with 2 years of experience, having developed over 10 apps I can say your seems of great interest to me and I'd like to tell you how I'd bring it to life. For starters, I'd kick-off with my teammate a specialized UI/UX designer, whom I trust the most and have the cleanest of communications to always achieve a perfect mix of what it's needed and what is wanted by clients. I like to work with specialized people, no jack of all traits. Since your application will track a lot of actitivies that is a lot of database resources, and even though it sounds as a niche product, it should be built for scalability, which is why once the user flows are created, a workfload units measurements based on the database structure should be provided to measure costs. Further down the road development should be pretty straightfoward and everything should be kept tidily, I'd carry on the management of this project since I've built enough MVPs to know how to sprint them. Since the full project specification is not provided I cannot give an estimate on the duration nor the budget of the project. I don't want to bloat my proposal either, so if you are interested in my approach let's chat. Ramon.", "winning": "no"}
,{"job_summary": "We are building an AI-driven platform to revolutionize the job search, and we've chosen Bubble.io as our core technology. Inspired by platforms like meilleursjobs .com, our vision is a more powerful and complete solution that empowers candidates with intelligent tools, deep company insights, and a seamless application tracker. The platform will serve as a central hub for job seekers and ultimately generate qualified leads for our training programs. Core Mission & Key Features: As the Lead Bubble.io Developer, you will spearhead the platform's development from the ground up, ensuring a scalable, robust, and secure product built efficiently on the Bubble platform. 1. Advanced Job Aggregation: Build a hybrid engine to centralize job listings by integrating commercial APIs (Coresignal, etc.) directly into Bubble. The system will manage data deduplication, normalization, and frequent updates via backend workflows. 2. AI-Powered Toolkit: Integrate LLMs (e.g., OpenAI/Gemini via API Connector) to provide: AI CV Customization: Automatically tailor a user's CV to specific job descriptions. AI Cover Letter Generation: Create unique cover letters for each application. 3. \"Notion-like\" Dashboard: Develop an intuitive dashboard for application tracking with features like status updates, reminders, and notes. 4. Company Intelligence (Premium): Offer a premium, credit-based module providing deep company insights, including activity summaries and personalized interview talking points. Required Tech Stack & Skills: We seek an autonomous and proactive senior Bubble.io developer experienced in building and scaling complex web apps. Platform: Deep, proven expertise in Bubble.io, with a strong portfolio of complex applications built on the platform. API Integration: Demonstrable, hands-on experience integrating various third-party REST APIs within Bubble's API Connector. This is critical for both the job aggregation and AI features. Custom Logic & Plugins: Ability to extend Bubble's native capabilities with custom logic, expressions, and plugins when required. Database Design: Strong understanding of efficient database design and optimization within the Bubble environment. Problem-Solving: A proactive developer skilled at finding creative no-code/low-code solutions for complex requirements. Language: Fluent in English for technical communication. What We Offer: Lead the technical development of an innovative product on a modern no-code stack. Significant autonomy in architectural and implementation choices within Bubble. A clear project vision with high impact potential. A long-term collaboration opportunity", "proposal": "Hi, nice to know you are going with Bubble for your product. I'd love to bring this product to life. I will tell you how I'd do it. This project would need some mid-fidelity designs at the very least and then some development. Given the complexity of your project I would divide this three phases - one to design 1/2 weeks, building the site and external automations 5-7 weeks and finally testing the application 1 week. The development would include user flows, external connections documentation and a whole deployment week of free mantainance to make sure everything is running smoothly. I've worked with dozen mvps and a couple of real-world apps in two-week sprints formats with no room for error in my former agency, you can find more about me here: https://myself.reymondar-projects.online/ So, I'd add n8n to your stack, along with any other necessary tools — whether for scraping data from external sites or for PDF generation, like pdfshift.io. The approach should stay simple: create an API call to OpenAI to generate each part of the user's CV separately. That way, you can reference and work with the data without needing to save it in Bubble's database. Same goes for the premium feature. You could use a fine-tuned model if you manage to scrape enough relevant data to teach the model the core things it needs to know. This part's a bit tricky, so a well-thought-out plan on how to approach it is a must. I'm confident I can bring your project to life, which is why I'm sending this proposal to you. If my approach is of interest to you, let's chat. Ramon", "winning": "no"}
,{"job_summary": "We are seeking a skilled developer to create an MVP for an event management platform. The project can be built using Bubble or from scratch, depending on your expertise. The ideal candidate will have a strong background in web development and an understanding of event management features. You will be responsible for designing, developing, and deploying the platform to meet our requirements. Strong communication skills and collaboration with our team are essential for this role. Preference goes to folks with blockchain/web3 experience.", "proposal": "It looks like you want to build an MVP about event management. First of, the design could be done on the go. If you are building an MVP I wouldn't recommend spending too much time on designing something that becomes time consuming, but of course, that's up to you. If you want to build something with event management features, I'd focus on scalability. Things can crash, so it's important to prioritize the key aspects. I'd address this by creating a database diagram flow to solidify what's going to be built. For the stack, I'd definitely recommend **Bubble.io**. It's the fastest way to build a full-stack application, making it the most cost-effective option as well. I developed in React for a couple of years using Xano as a backend and have been working with Bubble for a year now. I would like to hear more about what you have at hands and your ideas. Don't hesitate to contact me if you see me as a good fit.", "winning": "yes"}
